# Даны 2 числа a и b. Получить их сумму, разность и произведение
a = 10
b = 2
print("сумма")
print(a + b)

print("разность")
print(a - b)

print("произведение")
print(a * b)

# Даны числа x и y. Получить x − y / 1 + xy
x = 3
y = 4
print("Результат выражения x − y / 1 + xy")
print(x - y / 1 + x * y)

# Даны два числа. Найти среднее арифметическое и среднее геометрическое этих чисел
q = 16
w = 4
print("среднее арифметическое и среднее геометрическое")
print((q + w) / 2)

print("среднее геометрическое")
print((q * w) ** 0.5)

# Даны катеты прямоугольного треугольника. Найти его гипотенузу и площадь
i = 3
o = 4
print("гипотенуза ")
print((i ** 2 + o ** 2) ** 0.5)

print("площадь")
print(o / 2 * i)
